'''
Напишите программу, которая по заданному номеру четверти, показывает
диапазон возможных координат точек в этой четвери (x и y)
'''

print("Введите четверть:")
quarter = int(input())

if (quarter == 1):
    print("X: [1, 10], Y: [1, 10]")
elif (quarter == 2):
    print("X: [-10, 1], Y: [1, 10]")
elif (quarter == 3):
    print("X: [-10, 1], Y: [-10, 1]")
elif (quarter == 4):
    print("X: [1, 10], Y: [-10, 1]")